Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/atdf/PIC32CM2532LS00048.atdf
        <register modes="SPIS" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="SPIS Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="USART_EXT" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="USART_EXT Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="USART_INT" name="DATA" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="USART_INT Data">
          <bitfield name="DATA" caption="Data Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="I2CM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="I2CM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="SPIM" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPIM Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="SPIS" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="SPIS Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="USART_EXT" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART_EXT Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="USART_INT" name="DBGCTRL" offset="0x30" rw="RW" size="1" initval="0x00" caption="USART_INT Debug Control">
          <bitfield name="DBGSTOP" caption="Debug Mode" mask="0x1"/>
        </register>
        <register modes="I2CM" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="I2CM FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="I2CS" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="I2CS FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="SPIM" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="SPIM FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="SPIS" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="SPIS FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="USART_EXT" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="USART_EXT FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="USART_INT" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="USART_INT FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="I2CM" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="I2CM FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="I2CS" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="I2CS FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="SPIM" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="SPIM FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="SPIS" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="SPIS FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="USART_EXT" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="USART_EXT FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="USART_INT" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="USART_INT FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
      </register-group>
      <value-group name="SERCOM_I2CM_CTRLA__MODE">
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SDAHOLD">
        <value name="DIS" caption="Disabled" value="0x0"/>
        <value name="75NS" caption="50-100ns hold time" value="0x1"/>
        <value name="450NS" caption="300-600ns hold time" value="0x2"/>
        <value name="600NS" caption="400-800ns hold time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SPEED">
        <value name="SM" caption="Standard-Mode (SM) and Fast-Mode (FM)" value="0x0"/>
        <value name="FMP" caption="Fast-Mode Plus (FM+)" value="0x1"/>
        <value name="HS" caption="High-Speed Mode" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__INACTOUT">
        <value name="DIS" caption="Disable" value="0x0"/>
        <value name="55US" caption="5-6 SCL cycle time-out" value="0x1"/>
        <value name="105US" caption="10-11 SCL cycle time-out" value="0x2"/>
        <value name="205US" caption="20-21 SCL cycle time-out" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__MODE">
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SPEED">
        <value name="SM" caption="Standard-Mode (SM) and Fast-Mode (FM)" value="0x0"/>
        <value name="FMP" caption="Fast-Mode Plus (FM+)" value="0x1"/>
        <value name="HS" caption="High-Speed Mode" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SDAHOLD">
        <value name="DIS" caption="Disabled" value="0x0"/>
        <value name="75NS" caption="50-100ns hold time" value="0x1"/>
        <value name="450NS" caption="300-600ns hold time" value="0x2"/>
        <value name="600NS" caption="400-800ns hold time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLB__AMODE">
        <value name="MASK" caption="The slave responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK" value="0x0"/>
        <value name="2ADDRS" caption="The slave responds to the two unique addresses in ADDR and ADDRMASK" value="0x1"/>
        <value name="RANGE" caption="The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__MODE">
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__CPHA">
        <value name="LEADING_EDGE" caption="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" value="0x0"/>
        <value name="TRAILING_EDGE" caption="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" value="0x1"/>
      </value-group>
